[
  {
    "title": "Global Climate Summit Reaches Surprise Emissions Deal",
    "category": "World",
    "published": "2024-11-22",
    "summary": "Leaders from 70 nations agreed to accelerate emissions cuts and fund climate resilience projects over the next decade.",
    "link": "#"
  },
  {
    "title": "Central Bank Signals Possible Rate Cut in Early 2025",
    "category": "Business",
    "published": "2024-11-23",
    "summary": "Officials cited cooling inflation and slower hiring as reasons to consider easing monetary policy sooner than expected.",
    "link": "#"
  },
  {
    "title": "Breakthrough Battery Material Doubles EV Range in Lab Tests",
    "category": "Technology",
    "published": "2024-11-20",
    "summary": "Researchers report a silicon-graphene composite that could drastically reduce charging times and extend electric vehicle range.",
    "link": "#"
  },
  {
    "title": "Underdog Club Clinches Historic Championship Win",
    "category": "Sports",
    "published": "2024-11-24",
    "summary": "A last-minute goal sealed the club's first major title, ending a 50-year drought and sparking citywide celebrations.",
    "link": "#"
  },
  {
    "title": "New Study Links Sleep Quality to Heart Health",
    "category": "Health",
    "published": "2024-11-19",
    "summary": "Adults who regularly sleep fewer than six hours were found to have higher risks of hypertension and arterial plaque.",
    "link": "#"
  },
  {
    "title": "Private Lunar Lander Succeeds in Precision Night Landing",
    "category": "Science",
    "published": "2024-11-18",
    "summary": "The mission demonstrated autonomous navigation in darkness, paving the way for future resource mapping on the Moon.",
    "link": "#"
  },
  {
    "title": "Streaming Giant Announces Ad-Free Premium Tier Shake-Up",
    "category": "Entertainment",
    "published": "2024-11-21",
    "summary": "The company will merge its top tiers and introduce higher-resolution streams with offline downloads.",
    "link": "#"
  },
  {
    "title": "Local Elections Highlight Shift Toward Independent Candidates",
    "category": "Politics",
    "published": "2024-11-16",
    "summary": "Independents captured several council seats in major cities, signaling voter appetite for nonpartisan platforms.",
    "link": "#"
  },
  {
    "title": "Tech Workers Rally for Stronger AI Safety Standards",
    "category": "Technology",
    "published": "2024-11-17",
    "summary": "Organizers called for clearer guardrails around generative AI deployments and stronger whistleblower protections.",
    "link": "#"
  },
  {
    "title": "Historic Coastal Town Implements Ambitious Flood Plan",
    "category": "World",
    "published": "2024-11-15",
    "summary": "A network of green barriers and elevated walkways aims to protect the community from future storm surges.",
    "link": "#"
  },
  {
    "title": "Study Shows Teens Spending More Time on Long-Form Articles",
    "category": "Science",
    "published": "2024-11-12",
    "summary": "Contrary to expectations, teens reported reading more investigative journalism on their phones this year.",
    "link": "#"
  },
  {
    "title": "Regional Startup Raises $120M for Clean Cement Tech",
    "category": "Business",
    "published": "2024-11-10",
    "summary": "Investors back a novel kiln process that captures carbon while lowering the energy footprint of cement production.",
    "link": "#"
  },
  {
    "title": "National Park Service Reports Record Autumn Attendance",
    "category": "Travel",
    "published": "2024-11-09",
    "summary": "Cooler temperatures and extended hours attracted more visitors to popular trails and scenic drives.",
    "link": "#"
  },
  {
    "title": "Neighborhood Food Co-op Expands Affordable Delivery",
    "category": "Lifestyle",
    "published": "2024-11-08",
    "summary": "The co-op's new delivery vans will bring fresh produce to seniors and low-income families twice a week.",
    "link": "#"
  },
  {
    "title": "City Council Approves Car-Free Downtown Pilot",
    "category": "Politics",
    "published": "2024-11-07",
    "summary": "The six-month pilot will convert key streets into pedestrian plazas with expanded bike lanes.",
    "link": "#"
  },
  {
    "title": "Scientists Map Hidden Ocean Currents Beneath Arctic Ice",
    "category": "Science",
    "published": "2024-11-06",
    "summary": "New sensors reveal faster-than-expected currents that could influence ice melt and marine ecosystems.",
    "link": "#"
  },
  {
    "title": "Hospital Tests AI Tool to Reduce ER Wait Times",
    "category": "Health",
    "published": "2024-11-05",
    "summary": "The pilot system predicts patient flow and recommends staffing adjustments to speed up triage.",
    "link": "#"
  },
  {
    "title": "Independent Film Wins Audience Award at Autumn Festival",
    "category": "Entertainment",
    "published": "2024-11-04",
    "summary": "The film's director thanked community crowdfunders who helped the project stay on schedule.",
    "link": "#"
  },
  {
    "title": "Marathon Runner Sets Personal Best in Rain-Soaked Race",
    "category": "Sports",
    "published": "2024-11-03",
    "summary": "Despite poor weather, the runner shaved four minutes off their previous time and qualified for nationals.",
    "link": "#"
  },
  {
    "title": "Developers Release Open-Source Toolkit for Green Homes",
    "category": "Technology",
    "published": "2024-11-02",
    "summary": "The toolkit provides templates and simulation tools to help architects design energy-efficient housing.",
    "link": "#"
  }
]
